Table of Contents
 Class OriginSettings
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
OriginProject
public class OriginSettings : OpenObject
Inheritance
object
OpenObject
OriginSettings
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OriginSettings()
Constructor
public OriginSettings()
Properties
 Author
Name of author of project
public string Author { get; set; }
Property Value
string
 CheckEquilibrium
All loads have to be in equilibrium
public bool CheckEquilibrium { get; set; }
Property Value
bool
 CountryCode
CountryCode
public CountryCode CountryCode { get; set; }
Property Value
CountryCode
 CrossSectionConversionTable
Conversion table for Parameters
public CrossSectionConversionTable CrossSectionConversionTable { get; set; }
Property Value
CrossSectionConversionTable
 DateOfCreate
Date of create project
public DateTime DateOfCreate { get; set; }
Property Value
DateTime
 ImportRecommendedWelds
Import also recommended welds
public bool ImportRecommendedWelds { get; set; }
Property Value
bool
 ProjectDescription
Description of project
public string ProjectDescription { get; set; }
Property Value
string
 ProjectName
Name of project
public string ProjectName { get; set; }
Property Value
string
 Edit this page